create table employee(
                         id int unsigned primary key auto_increment comment 'ID,主键',
                         username varchar(20) not null unique comment '用户名',
                         password varchar(32) not null comment '密码',
                         name varchar(10) not null comment '姓名',
                         gender tinyint unsigned not null comment '性别, 1:男, 2:女',
                         phone char(11) not null unique comment '手机号',
                         job tinyint unsigned comment '职位, 1:媒介,2:策划,3:客户经理,4:创意总监,5:投放专员',
                         salary int unsigned comment '薪资',
                         image varchar(255) comment '头像',
                         entry_date date comment '入职日期',
                         create_time datetime comment '创建时间',
                         update_time datetime comment '修改时间'
) comment '员工表';

-- 准备测试数据
INSERT INTO employee(id, username, password, name, gender, phone, job, salary, image, entry_date, create_time, update_time)
VALUES (1,'tangsen','123456','唐僧',1,'13309090001',4,16500,'1.jpg','2004-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (2,'wukong','123456','悟空',1,'13309090002',2,10100,'2.jpg','2019-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (3,'bajie','123456','八戒',1,'13309090003',2,10400,'3.jpg','2012-05-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (4,'wujing','123456','悟净',1,'13309090004',2,10700,'4.jpg','2011-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (5,'yutang','123456','玉兔',2,'13309090005',2,11000,'5.jpg','2016-12-05','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (6,'nichang','123456','霓裳',2,'13309090006',3,8000,'6.jpg','2017-09-05','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (7,'yulong','123456','玉龙',1,'13309090007',1,6200,'7.jpg','2009-08-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (8,'niumowang','123456','牛魔王',1,'13309090008',1,6300,'8.jpg','2018-11-09','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (9,'tieshan','123456','铁扇',2,'13309090009',1,6400,'9.jpg','2015-03-11','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (10,'baigujing','123456','白骨精',2,'13309090010',1,6500,'10.jpg','2017-09-05','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (11,'erlang','123456','二郎',1,'13309090011',2,11200,'11.jpg','2011-02-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (12,'zizhu','123456','紫珠',2,'13309090012',2,11500,'12.jpg','2012-08-18','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (13,'taibai','123456','太白',1,'13309090013',1,6800,'13.jpg','2016-11-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (14,'jigong','123456','济公',1,'13309090014',2,12100,'14.jpg','2006-08-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (15,'mojing','123456','墨晶',2,'13309090015',2,12400,'15.jpg','2015-05-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (16,'yuanshi','123456','元始',1,'13309090016',2,11100,'16.jpg','2014-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (17,'zhenyuan','12345678','镇元',1,'13309090017',1,7300,'17.jpg','2019-03-21','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (18,'xiaoqian','123456','小倩',2,'13309090018',2,11700,'18.jpg','2019-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (19,'qingfeng','123456','青凤',2,'13309090019',2,12000,'19.jpg','2012-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (20,'lingtong','123456','灵童',1,'13309090020',2,12300,'20.jpg','2022-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (21,'hanxiangzi','123456','韩湘子',1,'13309090021',5,6700,'21.jpg','2019-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (22,'ludongbin','123456','吕洞宾',1,'13309090022',5,7000,'22.jpg','2020-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (23,'zhongliquan','123456','钟离权',1,'13309090023',5,7300,'23.jpg','2016-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (24,'caoguojiu','123456','曹国舅',1,'13309090024',5,6500,'24.jpg','2010-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (25,'hexiangu','123456','何仙姑',2,'13309090025',5,6300,'25.jpg','2006-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (26,'zhangguolao','123456','张果老',1,'13309090026',5,6900,'26.jpg','2015-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (27,'tieguaili','123456','铁拐李',1,'13309090027',5,8100,'27.jpg','2008-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (28,'lancaihe','123456','蓝采和',1,'13309090028',5,6500,'28.jpg','2011-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (29,'chenxiang','123456','沉香',1,'13309090029',5,6600,'29.jpg','2024-01-01','2026-08-01 13:14:52','2026-08-01 14:13:52'),
       (30,'xiaoerlang','123456','小二郎',1,'13309090030',NULL,NULL,'30.jpg','2024-03-01','2026-08-01 13:14:52','2026-08-01 14:13:52');

-- --------------------> DQL 表操作 【数据操作语言】<--------------------------
-- --------------------> DQL：基本查询 - select <----------------------------
-- ℹ️ 基本查询： select 字段列表  from  表名列表;
-- 查询多个字段 ：
-- select 字段1,字段2,字段3 from 表名;

-- *号代表查询所有字段，在实际开发中尽量少用(不直观、影响效率）。
-- 查询所有字段(通配符) ：
-- select * from 表名;

-- 为查询字段设置别名，as关键字可以省略：
-- select 字段1 [as 别名1]，字段2 [as 别名2]from 表名;

-- 去除重复记录：
-- select distinct 字段列表 from 表名;

-- 练习：
-- 1. 查询指定字段 name,entry_date 并返回
select employee.name,employee.entry_date from employee;

-- 2. 查询返回所有字段
select id, username, password, name, gender, phone, job, salary, entry_date, image, create_time, update_time from employee;
-- select * from employee 不推荐使用

-- 3. 查询所有员工的 name,entry_date, 并起别名(姓名、入职日期、职位) 通常省略as关键字
select name as '姓 名' ,entry_date as 入职日期 ,job 职位 from employee;

-- 4. 查询已有的员工关联了哪几种职位(不要重复)
select distinct job from employee;

-- --------------------> DQL：条件查询 - where <----------------------------
-- ℹ️ 条件查询：where 条件字段
-- select 字段列表 from 表名  where  条件列表;

--  比较运算符	        功能
--      >	            大于
--      >=	            大于等于
--      <	            小于
--      <=	            小于等于
--      =	            等于
--   <> 或 !=	        不等于
-- between ... and ...	在某个范围之内（包含最小值、最大值）
--  in(...)	            在 in 之后列表中的值，多选一
--  like 占位符	        模糊匹配（ _ 匹配单个任意字符， % 匹配任意多个字符）
--  is null	            判断值为 null ⚠️ 注意：不能使用 = null 查询空值

--  逻辑运算符	        功能
--  and 或 &&	        并且，多个条件同时成立
--  or  或 ||		    或者，多个条件任意一个成立
--  not 或 !	        非，取反（不满足条件）

-- 练习：
-- 1. 查询 姓名 为 悟空 的员工
select * from employee where name = '悟空';

-- 2. 查询 薪资小于等于7000 的员工信息
select * from employee where salary <= 7000;

-- 3. 查询 没有分配职位 的员工信息
select * from employee where job is null ;

-- 4. 查询 有职位 的员工信息
select * from employee where job is not null ;

-- 5. 查询 密码不等于 '123456' 的员工信息
select * from employee where password != '123456' ;
select * from employee where password <> '123456' ;

-- 6. 查询 入职日期 在 '2004-01-01' (包含) 到 '2010-01-01'(包含) 之间的员工信息
select * from employee where entry_date between '2004-01-01' and '2010-01-01';

-- 7. 查询 入职时间 在 '2004-01-01' (包含) 到 '2010-01-01'(包含) 之间 且 性别为女 的员工信息
select * from employee where (entry_date between '2004-01-01' and '2010-01-01') and gender = 2;

-- 8. 查询 职位是 2(策划),3(客户经理),4(创意总监) 的员工信息
select * from employee where job = 2 or job = 3 or job = 4;
select * from employee where job in (2,3,4);

-- 9. 查询 姓名 为两个字的员工信息  模糊匹配（ _ 匹配单个任意字符， % 匹配任意多个字符）
select * from employee where name like '__';

-- 10. 查询 姓 '白' 的员工信息
select * from employee where name like '白%';

-- 11. 查询 姓名中包含 '二' 的员工信息
select * from employee where name like '%二%';

-- --------------------> DQL：分组查询 - group by<----------------------------
-- ℹ️ 分组查询：group by  分组字段  having 分组条件
-- select 字段列表 from 表名 [where 条件列表] group by 分组字段列表 [having 分组后条件列表];
-- where与having的区别：
-- 1. 执行时机不同：where是分组之前进行过滤，不满足where条件，不参与分组；而having是分组之后对结果进行过滤。
-- 2. 判断条件不同：where不能对聚合函数进行判断，而having可以。
-- ⚠️注意：
-- 1. 分组之后，查询的字段一般为 聚合函数 + 分组字段 ，查询其他字段无任何意义。
-- 2. 执行顺序：where（不可以使用聚合函数） > （分组操作group by）聚合函数 > having 可以使用聚合函数。

-- 聚合函数：将一列数据作为一个整体，进行纵向计算。（聚合函数不参与null值的统计）
-- 常见函数	功能
-- count	统计数量（具体字段、* 、常量）
--  max	    最大值
--  min  	最小值
--  avg	    平均值
--  sum	    求和

-- 聚合练习：
-- 1. 统计该企业员工数量
-- select count(id) from employee;  -- 性能较低
select count(*) from employee; -- 性能较好
select count(1) from employee;

-- 2. 统计该企业员工的平均薪资
select avg(salary) from employee;

-- 3. 统计该企业员工的最低薪资
select min(salary) from employee;

-- 4. 统计该企业员工的最高薪资
select max(salary) from employee;

-- 5. 统计该企业每月要给员工发放的薪资总额(薪资之和)
select sum(salary) from employee;

-- 分组练习:
-- 1. 根据性别分组 , 统计男性和女性员工的数量
-- 注意：分组之后，select后的字段列表不能随意书写，能写的一般是 分组字段+聚合函数；
select gender ,count(*) from employee group by gender;

-- 2. 先查询入职时间在 '2019-01-01' (包含) 以前的员工 , 并对结果根据职位分组 , 获取员工数量大于等于2的职位
select  job ,count(*) from employee where entry_date <= '2019-01-01' group by job having count(job) >= 2;

-- --------------------> DQL：排序查询 - order by <----------------------------
-- ℹ️ 排序查询： order by   排序字段列表
-- select 字段列表 from 表名[where 条件列表] [group by 分组字段名 having 分组后过滤条件] order by 排序字段 排序方式;
-- 排序方式：升序（asc），降序（desc）；默认为升序asc，是可以不写的。
-- ⚠️如果是多字段排序，当第一个字段值相同时，才会根据第二个字段进行排序。

-- 练习：
-- 1. 根据入职时间, 对员工进行升序排序
select * from employee order by entry_date asc ;

-- 2. 根据入职时间, 对员工进行降序排序
select * from employee order by entry_date desc ;

-- 3. 根据 更新时间 对公司的员工进行 升序排序 ， 更新时间相同 , 再按照 入职时间 进行降序排序
select * from employee order by update_time , entry_date desc ;

-- --------------------> DQL：分页查询 - limit <----------------------------
-- ℹ️ 分页查询： limit 分页参数
-- select 字段 from 表名 [where 条件] [group by 分组字段 having 过滤条件] [order by 排序字段] limit 起始索引,查询记录数;

-- 1. 起始索引从 0 开始。
-- 2. ⚠️分页查询是数据库的方言，不同的数据库有不同的实现，MySQL中是LIMIT。
-- 3. 如果起始索引为 0 ，起始索引可以省略，直接简写为 limit 10。

-- 练习：
-- 1. 从起始索引0开始查询员工数据, 每页展示5条记录
select * from employee limit 5;

-- 2. 查询 第1页 员工数据, 每页展示5条记录
select * from employee limit 0,5;

-- 3. 查询 第2页 员工数据, 每页展示5条记录
select * from employee limit 5,5;

-- 4. 查询 第3页 员工数据, 每页展示5条记录
select * from employee limit 10,5;

-- MySQL的分页查询语法：
-- 页码 = i       （页码由前端传递过来）
-- 每页展示记录数 = j
-- 起始索引 = (i - 1) * j